CSI API ETABS v1
cAnalysisResults.PanelZoneForce Method
 Reports the panel zone (link) forces at the point elements at the ends of the specified panel zone (link) elements
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int PanelZoneForce(
	string Name,
	eItemTypeElm ItemTypeElm,
	ref int NumberResults,
	ref string[] Elm,
	ref string[] PointElm,
	ref string[] LoadCase,
	ref string[] StepType,
	ref double[] StepNum,
	ref double[] P,
	ref double[] V2,
	ref double[] V3,
	ref double[] T,
	ref double[] M2,
	ref double[] M3
)
Function PanelZoneForce (
	Name As String,
	ItemTypeElm As eItemTypeElm,
	ByRef NumberResults As Integer,
	ByRef Elm As String(),
	ByRef PointElm As String(),
	ByRef LoadCase As String(),
	ByRef StepType As String(),
	ByRef StepNum As Double(),
	ByRef P As Double(),
	ByRef V2 As Double(),
	ByRef V3 As Double(),
	ByRef T As Double(),
	ByRef M2 As Double(),
	ByRef M3 As Double()
) As Integer
Dim instance As cAnalysisResults
Dim Name As String
Dim ItemTypeElm As eItemTypeElm
Dim NumberResults As Integer
Dim Elm As String()
Dim PointElm As String()
Dim LoadCase As String()
Dim StepType As String()
Dim StepNum As Double()
Dim P As Double()
Dim V2 As Double()
Dim V3 As Double()
Dim T As Double()
Dim M2 As Double()
Dim M3 As Double()
Dim returnValue As Integer
returnValue = instance.PanelZoneForce(Name,
	ItemTypeElm, NumberResults, Elm,
	PointElm, LoadCase, StepType, StepNum,
	P, V2, V3, T, M2, M3)
int PanelZoneForce(
	String^ Name,
	eItemTypeElm ItemTypeElm,
	int% NumberResults,
	array<String^>^% Elm,
	array<String^>^% PointElm,
	array<String^>^% LoadCase,
	array<String^>^% StepType,
	array<double>^% StepNum,
	array<double>^% P,
	array<double>^% V2,
	array<double>^% V3,
	array<double>^% T,
	array<double>^% M2,
	array<double>^% M3
)
abstract PanelZoneForce :
        Name : string *
        ItemTypeElm : eItemTypeElm *
        NumberResults : int byref *
        Elm : string[] byref *
        PointElm : string[] byref *
        LoadCase : string[] byref *
        StepType : string[] byref *
        StepNum : float[] byref *
        P : float[] byref *
        V2 : float[] byref *
        V3 : float[] byref *
        T : float[] byref *
        M2 : float[] byref *
        M3 : float[] byref -> int
Parameters
Name
Type: System.String
 The name of an existing point object, point element, or group of objects depending on the value of the ItemTypeElm item.
ItemTypeElm
Type: ETABSv1.eItemTypeElm
 This is one of the following items in the eItemTypeElm enumeration.
 If this item is ObjectElm, the result request is for the panel zone (link) element corresponding to the panel zone assignment to the point object specified by the Name item.
 If this item is Element, the result request is for the panel zone (link) element specified by the Name item.
 If this item is GroupElm, the result request is for all panel zone (link) elements directly or indirectly specified in the group specified by the Name item.
 If this item is SelectionElm, the result request is for all panel zone (link) elements directly or indirectly selected and the Name item is ignored.
 For GroupElm and SelectionElm a panel zone (link) element may be indirectly specified through point objects that have panel zone assignments.
NumberResults
Type: System.Int32
 The total number of results returned by the program.
Elm
Type: System.String[]
 This is an array that includes the panel zone (link) element name associated with each result.
PointElm
Type: System.String[]
 This is an array that includes the point element name associated with each result.
LoadCase
Type: System.String[]
 This is an array that includes the name of the analysis case or load combination associated with each result.
StepType
Type: System.String[]
 This is an array that includes the step type, if any, for each result.
StepNum
Type: System.Double[]
 This is an array that includes the step number, if any, for each result.
P
Type: System.Double[]
 This is an array that includes the panel zone (link) axial force (in the link local 1-axis direction) at the specified point element. [F]
V2
Type: System.Double[]
 This is an array that includes the panel zone (link) shear force component in the link element local 2-axis direction. [F]
V3
Type: System.Double[]
 This is an array that includes the panel zone (link) shear force component in the link element local 3-axis direction. [F]
T
Type: System.Double[]
 This is an array that includes the panel zone (link) torsion (about the link local 1-axis) at the specified point element. [FL]
M2
Type: System.Double[]
 This is an array that includes the panel zone (link) moment component about the link element local 2-axis. [F]
M3
Type: System.Double[]
 This is an array that includes the panel zone (link) moment component about the link element local 3-axis. [F]
Return Value
Type: Int32
 Returns zero if the forces are successfully recovered, otherwise it returns a nonzero value
Remarks
 See Results for more information.
Examples
Public Sub Example()
   'dimension variables
   Dim SapObject as cOAPI
   Dim SapModel As cSapModel
   Dim ret As Integer = -1
   Dim NumberResults As Integer
   Dim Elm() As String
   Dim PointElm() As String
   Dim LoadCase() As String
   Dim StepType() As String
   Dim StepNum() As Double
   Dim P() As Double
   Dim V2() As Double
   Dim V3() As Double
   Dim T() As Double
   Dim M2() As Double
   Dim M3() As Double
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'assign panel zone to point object "3"
       ret = SapModel.PointObj.SetPanelZone("3", 1, 2, 0, 0, "", 0, 0, 0)
   'run analysis
       System.IO.Directory.CreateDirectory("c:\CSI_API_temp")
       ret = SapModel.File.Save("C:\CSI_API_temp\example.edb")
       ret = SapModel.Analyze.RunAnalysis()
   'deselect all cases and combos
       ret = SapModel.Results.Setup.DeselectAllCasesAndCombosForOutput()
   'set case selected for output
       ret = SapModel.Results.Setup.SetCaseSelectedForOutput("MODAL")
   'get panel zone force for point object "3"
       ret = SapModel.Results.PanelZoneForce("3", eItemTypeElm.ObjectElm, NumberResults, Elm, PointElm, LoadCase, StepType, StepNum, P, V2, V3, T, M2, M3)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cAnalysisResults Interface
ETABSv1 Namespace